Revit 2024 API
PointCloudEngineRegistry.UnregisterPointCloudEngine Method
 Unregisters the point cloud engine associated to a particular identifier.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static void UnregisterPointCloudEngine(
	string identifier
)
Visual Basic
Public Shared Sub UnregisterPointCloudEngine ( _
	identifier As String _
)
Visual C++
public:
static void UnregisterPointCloudEngine(
	String^ identifier
)
Parameters
identifier
Type: System.String
 The identifier of the engine to be unregistered.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace